In [1]:
import pandas as pd
import  numpy as np

- np.nan : not a number this applicable for numerical columns
- Generally data has some empty rows
- It is a data problem
- If you read that kind of data you will see Null
- you need to understand it is a data corrupted or really a Null values are there

In [3]:
dict1={'Names':['Arvind','Samar',np.nan,'siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chnnai',np.nan]}
dict1

{'Names': ['Arvind', 'Samar', nan, 'siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chnnai', nan]}

In [7]:
d1=pd.DataFrame(dict1)
d1

    Names   Age    City
0  Arvind   NaN     Hyd
1   Samar  21.0     Blr
2     NaN  32.0  Chnnai
3    siri  43.0     NaN

In [8]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [9]:
dict2={'Names':['Arvind','Samar',None,'siri'],
      'Age':[None,21,32,43],
      'City':['Hyd','Blr','Chnnai',None]}
dict2
d2=pd.DataFrame(dict2)
d2

    Names   Age    City
0  Arvind   NaN     Hyd
1   Samar  21.0     Blr
2    None  32.0  Chnnai
3    siri  43.0    None

In [16]:
d1.isnull()
#len(d1)

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [14]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

**method-1**   
**Fill with some random value**   
**method name:fill na**

In [17]:
d1.fillna(40)

    Names   Age    City
0  Arvind  40.0     Hyd
1   Samar  21.0     Blr
2      40  32.0  Chnnai
3    siri  43.0      40

**method-2**
- we can fill the values with respect to columns also

In [24]:
d1['Age'].fillna(40,inplace=True)
#it will not updated
#inplace=False

In [25]:
d1

    Names   Age    City
0  Arvind  40.0     Hyd
1   Samar  21.0     Blr
2     NaN  32.0  Chnnai
3    siri  43.0     NaN

In [27]:
d1['City'].fillna('Pune',inplace=True)
d1

    Names   Age    City
0  Arvind  40.0     Hyd
1   Samar  21.0     Blr
2     NaN  32.0  Chnnai
3    siri  43.0    Pune

In [29]:
d1['Names'].fillna('Akash',inplace=True)
d1

    Names   Age    City
0  Arvind  40.0     Hyd
1   Samar  21.0     Blr
2   Akash  32.0  Chnnai
3    siri  43.0    Pune

In [33]:
dict1={'Names':['Arvind','Samar',np.nan,'siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    siri  43.0      NaN

**Method-3**
- bfill
- ffill
- pad
- backfill
- backfill and bfill with Next value
- pad and ffill with previos value
- but it will changed based on axis

In [35]:
d1.fillna(method='bfill')
#It will fill with below value or next value
#column1:Names index 3 is missing values it is filled with index 4
#column2 : Age index 1 is missing values it is filled with inndex 2
#column3 : City index 4 is missing values it is not filled because there is no next value

C:\Users\surya\AppData\Local\Temp\ipykernel_22304\3694445602.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

    Names   Age     City
0  Arvind  21.0      Hyd
1   Samar  21.0      Blr
2    siri  32.0  Chennai
3    siri  43.0      NaN

In [45]:
d1.fillna(method='ffill',axis=1)
# axis=1 take column values

C:\Users\surya\AppData\Local\Temp\ipykernel_22304\13672963.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill',axis=1)

    Names     Age     City
0  Arvind  Arvind      Hyd
1   Samar    21.0      Blr
2     NaN    32.0  Chennai
3    siri    43.0     43.0

In [44]:
d1.fillna(method='pad')

C:\Users\surya\AppData\Local\Temp\ipykernel_22304\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    siri  43.0  Chennai

In [43]:
d1.fillna(method='pad')

C:\Users\surya\AppData\Local\Temp\ipykernel_22304\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    siri  43.0  Chennai

**method-4**
- 1)mean
  - Numerical values can fill with mean value
  - but mean affect by  outlier
  - if we dont have outlier it is best one
- 2)median
  - Numerical values can fill with median value
  - we know that median values does not affect with outlier
  - so if outlier are there we can go with median
- 3)mode
  - mode is useful for categorical data

In [46]:
dict1={'Names':['Arvind','Samar',np.nan,'siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    siri  43.0      NaN

In [47]:
# we already know we can fill with some values based on specific columns using fillna
#d1.fillna(<random_number>)
#d1 represents all the columns

age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [48]:
dict1={'Names':['Arvind','Samar',np.nan,'siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    siri  43.0      NaN

In [49]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [52]:
d1['City'].mode()
#d1['City'].fillna(city_mode)
#In this use case we are getting mode equal
# But in realtime

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- fill with random value
- fill with methods
  - bfill
  - ffill
  - pad
  - backfill
- fill with
  - mean
  - median
  - mode

**method-5**   
**KNN imputer**
-  KNN : K nearest Neighbours
-  K is a hyper parameter means user can choose
-  It is distnace metric : **Euclidian distance**
-  KNN imputer will take the mean of the neigbour value
-  The neighbour value can provided by using value = k
-  It is under sklearn package
-  Under sklearn we have Imputer method
-  Under imputer method we have Knnimputer
-  Application only for Numerical data

In [56]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])